---------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/elisa/Documents/5. Research/TFG EI/log/1b_Data_cleaning_25May2022.txt
  log type:  text
 opened on:  25 May 2022, 17:27:52

. 
. 
. ***********************************
. **** CPS DATA
. ***********************************
. 
. *------ Common data cleaning for all CPS supplements -----------------------*
. 
. local supplement voters civic volunteer

. 
. foreach s of local supplement {
  2.         
.         use "${temp}/cps_`s'_raw.dta", clear 
  3.         
.         *** Technical variables
.         rename year survey_year
  4.         rename month survey_month
  5.         
.         *** Geographical variables
.         * Delete observations that do not have an identified county
.         drop if county==0
  6.         
.         * Create variable with consistent 5-digit string FIPS code
.         gen fips = string(county,"%05.0f") // Previously, some states missed front 0
  7.         drop county
  8.                 
.         *** Socio-economic and demographic variables
.         * Recode sex
.         gen female= sex-1
  9.         drop sex
 10.         
.         * Dummy for single
.         gen single = 0
 11.         replace single = 1 if marst==6
 12.         replace single = . if marst==9
 13.         
.         * Dummy for low education
.         gen lowed = 0
 14.         replace lowed = 1 if (educ <= 73)
 15.         replace lowed = . if (educ==000|educ==001|educ==999)
 16.         
.         // Race and ethnicity
.         
.         * Dummy for White
.         gen white = 0
 17.         replace white = 1 if race==100
 18.         
.         * Dummy for Black
.         gen black = 0
 19.         replace black = 1 if race==200
 20.         
.         * Dummy for Hispanic
.         gen hispanic = 1
 21.         replace hispanic = 0 if (hispan==000)
 22.         
.         * Dummy for non-Hispanic white
.         gen nonhispwhite = 0
 23.         replace nonhispwhite = 1 if (hispanic==0 & white==1)
 24.         
.         * Dummy for non-Hispanic black
.         gen nonhispblack = 0
 25.         replace nonhispblack = 1 if (hispanic==0 & black==1)
 26.         
.         * Dummy for Mexican
.         gen mexican = 0
 27.         replace mexican = 1 if hispan==100
 28.         
.         // Immigration status
.         
.         * Dummy for non-citizens
.         gen noncitizen = 0 
 29.         replace noncitizen = 1 if citizen==5
 30.                 
.         * Dummy for naturalized citizens
.         gen natcitizen = 0
 31.         replace natcitizen = 1 if citizen==4
 32.         
.         * Dummy for immigrants
.         gen immigrant = 0
 33.         replace immigrant =1 if (citizen==4 | citizen==5)
 34.         
.         * Dummy for natives
.         gen native = 0
 35.         replace native = 1 if (citizen==1 | citizen==2 | citizen==3)
 36.         
.         * Years in the US: NOT REALLY TRUST WORTHY DUE TO CODING OF CPS
.         gen yearsus = survey_year-yrimmig if native==0
 37.         replace yearsus=. if yrimmig==0000
 38.         replace yearsus= age if native==1
 39. 
.         
.         
.         *** Mixed-status Household
.         // Defined as different citizenship status (see Bitler and Hoynes, 2011)
.         * egen citizens_household = total(noncitizen==0), by(cpsid survey_year)
.         * egen totindv_household = total(cpsid != .), by(cpsid survey_year)
. 
.         * egen mixedstatus = count(totindv_household > citizens_household), by(cpsid survey_year)
.         * egen mixedstatus2 = count(totindv_household > citizens_household), by(serial survey_year)
.         // egen mixedstatus = count(totindv_household > citizens_household), by(serial survey_year)
. 
.         
.         // Defined as at least one likely undocumented migrant (see Amuedo-Dorantes and Lopez) --> this is a proxy (less reliable)
.         * Dummy for likely unauthorized migrant
.         gen likely_unauthorized = 0
 40.         replace likely_unauthorized = 1 if (noncitizen==1 & hispanic==1 & lowed==1 & yearsus>5 )
 41.         
.         egen likely_mixedstatus = total(likely_unauthorized==1), by(cpsid survey_year)
 42.         replace likely_mixedstatus = 1 if likely_mixedstatus > 1 // 1.69%
 43. 
.         *** Sample restriction: universe of possible voters (citizens and 18>=)
.         drop if noncitizen==1
 44.         drop if age<18
 45.         
.         // Reduce dataset
.         compress
 46.         
.         
.         save "${temp}/cps_`s'_temp.dta", replace
 47. }
(557,452 observations deleted)
(96,004 real changes made)
(76,574 real changes made, 76,574 to missing)
(212,403 real changes made)
(76,574 real changes made, 76,574 to missing)
(294,343 real changes made)
(49,555 real changes made)
(312,927 real changes made)
(227,255 real changes made)
(47,135 real changes made)
(44,717 real changes made)
(33,292 real changes made)
(27,884 real changes made)
(61,176 real changes made)
(324,814 real changes made)
(324,814 missing values generated)
(4 real changes made, 4 to missing)
(324,814 real changes made)
(11,089 real changes made)
(14,501 real changes made)
(33,292 observations deleted)
(89,304 observations deleted)
  variable female was float now byte
  variable single was float now byte
  variable lowed was float now byte
  variable white was float now byte
  variable black was float now byte
  variable hispanic was float now byte
  variable nonhispwhite was float now byte
  variable nonhispblack was float now byte
  variable mexican was float now byte
  variable noncitizen was float now byte
  variable natcitizen was float now byte
  variable immigrant was float now byte
  variable native was float now byte
  variable yearsus was float now byte
  variable likely_unauthorized was float now byte
  variable likely_mixedstatus was float now byte
  (12,642,912 bytes saved)
file C:/Users/elisa/Documents/5. Research/TFG EI/data/temp/cps_voters_temp.dta saved
(466,404 observations deleted)
(83,000 real changes made)
(64,181 real changes made, 64,181 to missing)
(178,522 real changes made)
(64,181 real changes made, 64,181 to missing)
(249,437 real changes made)
(42,554 real changes made)
(265,432 real changes made)
(191,651 real changes made)
(40,405 real changes made)
(38,923 real changes made)
(27,281 real changes made)
(24,857 real changes made)
(52,138 real changes made)
(276,369 real changes made)
(276,369 missing values generated)
(3 real changes made, 3 to missing)
(276,369 real changes made)
(9,658 real changes made)
(12,507 real changes made)
(27,281 observations deleted)
(75,010 observations deleted)
  variable female was float now byte
  variable single was float now byte
  variable lowed was float now byte
  variable white was float now byte
  variable black was float now byte
  variable hispanic was float now byte
  variable nonhispwhite was float now byte
  variable nonhispblack was float now byte
  variable mexican was float now byte
  variable noncitizen was float now byte
  variable natcitizen was float now byte
  variable immigrant was float now byte
  variable native was float now byte
  variable yearsus was float now byte
  variable likely_unauthorized was float now byte
  variable likely_mixedstatus was float now byte
  (10,858,368 bytes saved)
file C:/Users/elisa/Documents/5. Research/TFG EI/data/temp/cps_civic_temp.dta saved
(1,025,752 observations deleted)
(177,426 real changes made)
(141,842 real changes made, 141,842 to missing)
(395,000 real changes made)
(141,842 real changes made, 141,842 to missing)
(543,818 real changes made)
(91,207 real changes made)
(577,923 real changes made)
(420,203 real changes made)
(86,620 real changes made)
(83,037 real changes made)
(60,030 real changes made)
(51,606 real changes made)
(111,636 real changes made)
(601,279 real changes made)
(601,279 missing values generated)
(9 real changes made, 9 to missing)
(601,279 real changes made)
(20,853 real changes made)
(26,875 real changes made)
(60,030 observations deleted)
(165,695 observations deleted)
  variable female was float now byte
  variable single was float now byte
  variable lowed was float now byte
  variable white was float now byte
  variable black was float now byte
  variable hispanic was float now byte
  variable nonhispwhite was float now byte
  variable nonhispblack was float now byte
  variable mexican was float now byte
  variable noncitizen was float now byte
  variable natcitizen was float now byte
  variable immigrant was float now byte
  variable native was float now byte
  variable yearsus was float now byte
  variable likely_unauthorized was float now byte
  variable likely_mixedstatus was float now byte
  (23,385,120 bytes saved)
file C:/Users/elisa/Documents/5. Research/TFG EI/data/temp/cps_volunteer_temp.dta saved

. */
. 
. 
. *------- Cleaning for CPS Voters and Registered ---------------------------*
.         use "${temp}/cps_voters_temp.dta", clear 

.         
. 
.         
.         * Dummy for presidential election
.         gen presidential = 0

.         replace presidential = 1 if (survey_year==2004|survey_year==2008|survey_year==2012|survey_year==2016)
(149,458 real changes made)

.         
.         * Dummy for registering to vote
.         gen registered = 1

.         replace registered = 0 if voreg==01
(42,370 real changes made)

.         replace registered = . if (voreg==96|voreg==97|voreg==98|voreg==99)
(187,812 real changes made, 187,812 to missing)

.         drop voreg

.         
.         * Dummy for voting
.         rename voted vote_cat

.         gen voted = 1

.         replace voted = 0 if vote_cat==01
(77,076 real changes made)

.         replace voted = . if (vote_cat==96|vote_cat==97|vote_cat==98|vote_cat==99)
(39,083 real changes made, 39,083 to missing)

.         drop vote_cat

.         
.         gen wr = round(vosuppwt)

.         
.         * Drop unwanted variables
.         drop vowhynot voynotreg voteresp

.         save "${temp}/cps_voters.dta", replace
(note: file C:/Users/elisa/Documents/5. Research/TFG EI/data/temp/cps_voters.dta not found)
file C:/Users/elisa/Documents/5. Research/TFG EI/data/temp/cps_voters.dta saved

. 
.         /*
> 
> *------- Cleaning for CPS Civic Engagement --------------------------------*
>         use "${temp}/cps_civic.dta", clear 
>         save "${temp}/cps_civic.dta", replace
>         
> *------- Cleaning for CPS Volunteers --------------------------------------*
>         use "${temp}/cps_volunteer.dta", clear 
>         save "${temp}/cps_volunteer.dta", replace
>         
> 
> 
> ***********************************
> **** US Governors 1775-2020: https://www.openicpsr.org/openicpsr/project/102000/version/V3/view?path=/openicpsr/102000/fcr:versions/V3/united_states_governor
> s_1775_2020.dta&type=file
> ***********************************
>         use "${data}/raw/united_states_governors_1775_2020.dta"
>         keep year state party
> 
>         gen statefip=.
>         replace statefip=01 if state=="Alabama"
>         replace statefip=02 if state=="Alaska"
>         replace statefip=04 if state=="Arizona"
>         replace statefip=05 if state=="Arkansas"
>         replace statefip=06 if state=="California"
>         replace statefip=08 if state=="Colorado"
>         replace statefip=09 if state=="Connecticut"
>         replace statefip=10 if state=="Delaware"
>         replace statefip=11 if state=="District of Columbia"
>         replace statefip=12 if state=="Florida"
>         replace statefip=13 if state=="Georgia"
>         replace statefip=15 if state=="Hawaii"
>         replace statefip=16 if state=="Idaho"
>         replace statefip=17 if state=="Illinois"
>         replace statefip=18 if state=="Indiana"
>         replace statefip=19 if state=="Iowa"
>         replace statefip=20 if state=="Kansas"
>         replace statefip=21 if state=="Kentucky"
>         replace statefip=22 if state=="Louisiana"
>         replace statefip=23 if state=="Maine"
>         replace statefip=24 if state=="Maryland"
>         replace statefip=25 if state=="Massachusetts"
>         replace statefip=26 if state=="Michigan"
>         replace statefip=27 if state=="Minnesota"
>         replace statefip=28 if state=="Mississippi"
>         replace statefip=29 if state=="Missouri"
>         replace statefip=30 if state=="Montana"
>         replace statefip=31 if state=="Nebraska"
>         replace statefip=32 if state=="Nevada"
>         replace statefip=33 if state=="New Hampshire"
>         replace statefip=34 if state=="New Jersey"
>         replace statefip=35 if state=="New Mexico"
>         replace statefip=36 if state=="New York"
>         replace statefip=37 if state=="North Carolina"
>         replace statefip=38 if state=="North Dakota"
>         replace statefip=39 if state=="Ohio"
>         replace statefip=40 if state=="Oklahoma"
>         replace statefip=41 if state=="Oregon"
>         replace statefip=42 if state=="Pennsylvania"
>         replace statefip=44 if state=="Rhode Island"
>         replace statefip=45 if state=="South Carolina"
>         replace statefip=46 if state=="South Dakota"
>         replace statefip=47 if state=="Tennessee"
>         replace statefip=48 if state=="Texas"
>         replace statefip=49 if state=="Utah"
>         replace statefip=50 if state=="Vermont"
>         replace statefip=51 if state=="Virginia"
>         replace statefip=53 if state=="Washington"
>         replace statefip=54 if state=="West Virginia"
>         replace statefip=55 if state=="Wisconsin"
>         replace statefip=56 if state=="Wyoming"
>         
>         
>         // Drop Puerto Rico
>         drop if statefip==.
>         
>         // Dummy for Republican gov at the state-level
>         gen rep_state = 0
>         replace rep_state = 1 if party == "Republican"
>         drop party
>         
>         // Restrict year
>         drop if year>2016 | year <2004
>         rename year survey_year
>         
>         // Eliminate duplicates
>         duplicates drop statefip survey_year, force     
>         
>         save "${temp}/state_level_party.dta", replace
> 
> 
> ***********************************
> **** PER CAP INCOME BY COUNTY: BEA
> ***********************************
> 
>         use "${temp}/percapincome_county_raw.dta", clear
>         
>         // Keep only per capital personal income
>         drop if description == "Population (persons) 1/" | ///
>                         description == "Personal income (thousands of dollars)"
>                         
>         // Drop unwanted variables
>         drop geoname region tablename linecode industryclassification description unit
>         keep geofips v44-v57
>         
>         // Reshape dataset to ong format
>         foreach v of varlist v44-v57 {
>                 local x : variable label `v'
>                 rename `v' income_pc_state`x'
>                 }
>         reshape long income_pc_state, i(geofips) j(year)
>         
>         * Transform to common format as in CPS
>         destring(income_pc_state), replace ignore("(NA)")
>         rename geofips fips
>         drop if fips == "00000"
>         rename year survey_year
>         
>         save "${temp}/percapincome_county.dta", replace

end of do-file

. sum registered [w=wr]
(analytic weights assumed)

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
  registered |  75,582   201352973    .4420488   .4966336          0          1

. sum registered [fw=wr]

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  registered |201,352,973    .4420488    .4966303          0          1

. sum registered [i=wr]
i unknown weight type
r(198);

. sum registered [iw=wr]

    Variable |     Obs      Weight        Mean   Std.
>  Dev.       Min        Max
-------------+---------------------------------------
> --------------------------
  registered |  75,582   201352973    .4420488   .496
> 6303          0          1

. sum registered [aw=wr]

    Variable |     Obs      Weight        Mean   Std.
>  Dev.       Min        Max
-------------+---------------------------------------
> --------------------------
  registered |  75,582   201352973    .4420488   .496
> 6336          0          1

. sum registered

    Variable |        Obs        Mean    Std. Dev.   
>     Min        Max
-------------+---------------------------------------
> ------------------
  registered |     75,582    .4394168    .4963194    
>       0          1

. sum registered [fw=wr]

    Variable |        Obs        Mean    Std. Dev.   
>     Min        Max
-------------+---------------------------------------
> ------------------
  registered |201,352,973    .4420488    .4966303    
>       0          1

. sum registered [pw=wr]
pweights not allowed
r(101);

. sum voted [w=wr]
(analytic weights assumed)

    Variable |     Obs      Weight        Mean   Std. Dev.       Min        Max
-------------+-----------------------------------------------------------------
       voted | 224,311   578459540     .644985   .4785189          0          1

. sum noncitizen

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  noncitizen |    263,394           0           0          0          0

. sum voted [w=wr], if survey_year==2008
(analytic weights assumed)
option if not allowed
r(198);

. clear

. exit, clear
