---------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:/Users/Windows/Documents/5. Research/TFG EI/log/2a_Data_cleaning_cps_30Jun2022.txt
  log type:  text
 opened on:   1 Jul 2022, 11:42:37

. 
.         
. 
. /***************************************************************************
>                                  CPS DATA
> ****************************************************************************/
. 
. * ----- ASEC data ---------------------------------------------------------*
.         use "${raw}/cps_asec_raw.dta", clear 

.         
.         *** TECHNICAL VARIABLES
.         rename year survey_year

.         
.         *** GEOGRAPHICAL VARIABLES
.         * Delete observations that do not have an identified county
.         drop if county==0
(1,639,078 observations deleted)

.         
.         * Create variable with consistent 5-digit string FIPS code
.         gen fips = string(county,"%05.0f") // Previously, some states missed front 0

.         drop county

.         
.         * Recode missing and negative values (might be lost investments)
.         replace ftotval = . if ftotval == 9999999999 | ftotval<0
(702 real changes made, 702 to missing)

.         
.         * Generate round weight
.         gen wr = .
(1,203,135 missing values generated)

.         replace wr = round(asecwt)
(1,203,135 real changes made)

.         
.         
.         // County-level
.         preserve

.                 collapse (mean) county_inc= ftotval /// 
>                 [w=wr], by(fips survey_year)
(analytic weights assumed)

.                 
.                 save "${temp}/county_income.dta", replace
file C:/Users/Windows/Documents/5. Research/TFG EI/data/temp/county_income.dta saved

.         restore

.         
.         /*
>         // State-level
>          collapse (mean) state_inc= ftotval /// 
>                 [w=wr], by(statefip survey_year)
>                 
>         save "${temp}/state_income.dta", replace
>         */
. 
. 
. *------ Common data cleaning for all CPS supplements -----------------------*
. 
. local supplements voters civic volunteer

. 
. foreach s of local supplements {
  2.         
.         use "${raw}/cps_`s'_raw.dta", clear 
  3.         
.         *** TECHNICAL VARIABLES
.         rename year survey_year
  4.         rename month survey_month
  5.         
.         
.         gen survey_date = ym(survey_year, survey_month)
  6. 
.         
.         *** GEOGRAPHICAL VARIABLES
.         * Delete observations that do not have an identified county
.         drop if county==0
  7.         
.         * Create variable with consistent 5-digit string FIPS code
.         gen fips = string(county,"%05.0f") // Previously, some states missed front 0
  8.         drop county
  9.                 
.         *** SOCIO-ECONOMIC AND DEMOGRAPHIC VARIABLES
.         
.         * Recode family income and dummy for low income individuals
.         replace faminc = . if inrange(faminc,995,998)
 10.         
.         gen below50k = 0 
 11.         replace below50k = 1 if faminc < 800 // Low income
 12.         
.         * Recode sex
.         gen female= sex-1
 13.         drop sex
 14.         
.         * Dummy for married
.         gen married = 0
 15.         replace married = 1 if marst==1 | marst==2
 16.         replace married = . if marst==9
 17.         
.         * Dummy for education: high school or less, more than high school
.         gen lowed = 0
 18.         replace lowed = 1 if (educ <= 073)
 19.         replace lowed = . if (educ==001|educ==999)
 20.         
.         gen highed = 0
 21.         replace highed = 1 if educ > 073
 22.         replace highed = . if (educ==001|educ==999)
 23.         
.         
.         // Race and ethnicity
.         
.         * Dummy for White
.         gen white = 0
 24.         replace white = 1 if race==100
 25.         
.         * Dummy for Black
.         gen black = 0
 26.         replace black = 1 if race==200
 27.         
.         * Dummy for Hispanic
.         gen hispanic = 1
 28.         replace hispanic = 0 if (hispan==000)
 29.         
.         * Dummy for non-Hispanic white
.         gen nonhispwhite = 0
 30.         replace nonhispwhite = 1 if (hispanic==0 & white==1)
 31.         
.         * Dummy for non-Hispanic black
.         gen nonhispblack = 0
 32.         replace nonhispblack = 1 if (hispanic==0 & black==1)
 33.         
.         * Dummy for Mexican
.         gen mexican = 0
 34.         replace mexican = 1 if hispan==100
 35.         
.         // Immigration status
.         
.         * Dummy for non-citizens
.         gen noncitizen = 0 
 36.         replace noncitizen = 1 if citizen==5
 37.                 
.         * Dummy for naturalized citizens
.         gen naturalized = 0
 38.         replace naturalized = 1 if citizen==4
 39.         
.         * Dummy for immigrants
.         gen immigrant = 0
 40.         replace immigrant = 1 if (citizen==4 | citizen==5)
 41.         
.         * Dummy for natives
.         gen native = 0
 42.         replace native = 1 if inrange(citizen,1,3)
 43.         
.         * Years in the US: NOT REALLY TRUST WORTHY DUE TO CODING OF CPS
.         gen yearsus = survey_year-yrimmig if native==0
 44.         replace yearsus=. if yrimmig==0000
 45.         replace yearsus= age if native==1
 46.         
.         ** Recode orginial citizen_brown
.         drop citizen
 47.         gen citizen = 0
 48.         replace citizen =1 if noncitizen==0
 49.         
.         * Citizens a la brown
.         gen citizen_brown = 0
 50.         replace citizen_brown = 1 if native == 1 | (naturalized==1& yearsus>10)
 51.                         
.         * Mixed-status Household
.         
.         // Defined as different citizenship status (see Bitler and Hoynes, 2011)
.          egen citizens_household = total(noncitizen==0), by(cpsid survey_year)
 52.          egen noncitizens_household = total(noncitizen==1), by(cpsid survey_year)
 53.          egen totindv_household = total(cpsid != .), by(cpsid survey_year)
 54.          gen mixedstatus = 0
 55.          replace mixedstatus = 1 if (totindv_household > citizens_household)
 56.          replace mixedstatus = 0 if (totindv_household == noncitizens_household)
 57.         
.         
.         // Defined as at least one likely undocumented migrant (see Amuedo-Dorantes and Lopez) --
> > this is a proxy (less reliable)
.         
.         * Dummy for likely unauthorized migrant
.         gen likely_unauthorized = 0
 58.         replace likely_unauthorized = 1 if (noncitizen==1 & hispanic==1 & lowed==1 & yearsus>5
>  )
 59.         
.         egen likely_mixedstatus = total(likely_unauthorized==1), by(cpsid survey_year)
 60.         replace likely_mixedstatus = 1 if likely_mixedstatus > 1 
 61.         
.         
.         
.         *** COUNTY AND STATE CONTROLS:
.         
.         // Round weight and rename s.t. it is the same in every supplement
.         gen wr = .
 62.         
.         if "`s'" == "voters" {
 63.                 replace wr = round(vosuppwt)
 64.         }
 65.         if "`s'" == "civic" {
 66.                 replace wr = round(cesuppwt)
 67.         }
 68.         if "`s'" == "volunteer"{
 69.                 replace wr = round(vlsuppwt)
 70.         }
 71. 
.                 
.         * Dummy for presidential election
.         gen presidential = 0
 72.         replace presidential = 1 if (survey_year==2004|survey_year==2008|survey_year==2012|sur
> vey_year==2016)
 73.         
.          
.         // County-level controls: mixedstatus (real and likely) 
.         preserve
 74.                 collapse (mean) county_LMS=likely_mixedstatus county_unauthorized = likely_una
> uthorized county_MS=mixedstatus county_hisp=hispanic [w=wr], by(fips survey_year)
 75.                 
.                 tempfile countychars_cps
 76.                 save `countychars_cps'
 77.         restore
 78.         merge m:1 fips survey_year using `countychars_cps'
 79.         drop _merge
 80.         
.         // State-level controls: hispanic (to compare with real data)
.                 preserve
 81.                 collapse (mean) state_hisp=hispanic [w=wr], by(statefip survey_year)
 82.                 
.                 tempfile statechars_cps
 83.                 save `statechars_cps'
 84.         restore
 85.         merge m:1 statefip survey_year using `statechars_cps'
 86.         drop _merge
 87.         
.         
.         // Reduce dataset
.         compress        
 88.         save "${temp}/cps_`s'_temp.dta", replace
 89.         
. 
. }
(557,452 observations deleted)
(31,425 real changes made, 31,425 to missing)
(163,593 real changes made)
(157,994 real changes made)
(76,574 real changes made, 76,574 to missing)
(212,403 real changes made)
(76,574 real changes made, 76,574 to missing)
(173,587 real changes made)
(76,574 real changes made, 76,574 to missing)
(294,343 real changes made)
(49,555 real changes made)
(312,927 real changes made)
(227,255 real changes made)
(47,135 real changes made)
(44,717 real changes made)
(33,292 real changes made)
(27,884 real changes made)
(61,176 real changes made)
(324,814 real changes made)
(324,814 missing values generated)
(4 real changes made, 4 to missing)
(324,814 real changes made)
(352,698 real changes made)
(349,363 real changes made)
(62,214 real changes made)
(12,011 real changes made)
(11,089 real changes made)
(14,501 real changes made)
(385,990 missing values generated)
(385,990 real changes made)
(218,981 real changes made)
(analytic weights assumed)
file C:\Users\Windows\AppData\Local\Temp\ST_2fb0_000003.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           385,990  (_merge==3)
    -----------------------------------------
(analytic weights assumed)
file C:\Users\Windows\AppData\Local\Temp\ST_2fb0_000005.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           385,990  (_merge==3)
    -----------------------------------------
  variable survey_date was float now int
  variable below50k was float now byte
  variable female was float now byte
  variable married was float now byte
  variable lowed was float now byte
  variable highed was float now byte
  variable white was float now byte
  variable black was float now byte
  variable hispanic was float now byte
  variable nonhispwhite was float now byte
  variable nonhispblack was float now byte
  variable mexican was float now byte
  variable noncitizen was float now byte
  variable naturalized was float now byte
  variable immigrant was float now byte
  variable native was float now byte
  variable yearsus was float now byte
  variable citizen was float now byte
  variable citizen_brown was float now byte
  variable citizens_household was float now byte
  variable noncitizens_household was float now byte
  variable totindv_household was float now byte
  variable mixedstatus was float now byte
  variable likely_unauthorized was float now byte
  variable likely_mixedstatus was float now byte
  variable wr was float now int
  variable presidential was float now byte
  (30,493,210 bytes saved)
file C:/Users/Windows/Documents/5. Research/TFG EI/data/temp/cps_voters_temp.dta saved
(466,404 observations deleted)
(21,480 real changes made, 21,480 to missing)
(140,305 real changes made)
(133,968 real changes made)
(64,181 real changes made, 64,181 to missing)
(178,522 real changes made)
(64,181 real changes made, 64,181 to missing)
(149,985 real changes made)
(64,181 real changes made, 64,181 to missing)
(249,437 real changes made)
(42,554 real changes made)
(265,432 real changes made)
(191,651 real changes made)
(40,405 real changes made)
(38,923 real changes made)
(27,281 real changes made)
(24,857 real changes made)
(52,138 real changes made)
(276,369 real changes made)
(276,369 missing values generated)
(3 real changes made, 3 to missing)
(276,369 real changes made)
(301,226 real changes made)
(297,854 real changes made)
(51,926 real changes made)
(9,415 real changes made)
(9,658 real changes made)
(12,507 real changes made)
(328,507 missing values generated)
(328,507 real changes made)
(54,711 real changes made)
(analytic weights assumed)
file C:\Users\Windows\AppData\Local\Temp\ST_2fb0_000007.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                           136
        from master                       136  (_merge==1)
        from using                          0  (_merge==2)

    matched                           328,371  (_merge==3)
    -----------------------------------------
(analytic weights assumed)
file C:\Users\Windows\AppData\Local\Temp\ST_2fb0_000009.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           328,507  (_merge==3)
    -----------------------------------------
  variable survey_date was float now int
  variable below50k was float now byte
  variable female was float now byte
  variable married was float now byte
  variable lowed was float now byte
  variable highed was float now byte
  variable white was float now byte
  variable black was float now byte
  variable hispanic was float now byte
  variable nonhispwhite was float now byte
  variable nonhispblack was float now byte
  variable mexican was float now byte
  variable noncitizen was float now byte
  variable naturalized was float now byte
  variable immigrant was float now byte
  variable native was float now byte
  variable yearsus was float now byte
  variable citizen was float now byte
  variable citizen_brown was float now byte
  variable citizens_household was float now byte
  variable noncitizens_household was float now byte
  variable totindv_household was float now byte
  variable mixedstatus was float now byte
  variable likely_unauthorized was float now byte
  variable likely_mixedstatus was float now byte
  variable presidential was float now byte
  (25,295,039 bytes saved)
file C:/Users/Windows/Documents/5. Research/TFG EI/data/temp/cps_civic_temp.dta saved
(1,025,752 observations deleted)
(63,536 real changes made, 63,536 to missing)
(298,531 real changes made)
(290,914 real changes made)
(141,842 real changes made, 141,842 to missing)
(395,000 real changes made)
(141,842 real changes made, 141,842 to missing)
(317,915 real changes made)
(141,842 real changes made, 141,842 to missing)
(543,818 real changes made)
(91,207 real changes made)
(577,923 real changes made)
(420,203 real changes made)
(86,620 real changes made)
(83,037 real changes made)
(60,030 real changes made)
(51,606 real changes made)
(111,636 real changes made)
(601,279 real changes made)
(601,279 missing values generated)
(9 real changes made, 9 to missing)
(601,279 real changes made)
(652,885 real changes made)
(646,129 real changes made)
(112,103 real changes made)
(21,818 real changes made)
(20,853 real changes made)
(26,875 real changes made)
(712,915 missing values generated)
(712,915 real changes made)
(164,812 real changes made)
(analytic weights assumed)
file C:\Users\Windows\AppData\Local\Temp\ST_2fb0_00000b.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           712,915  (_merge==3)
    -----------------------------------------
(analytic weights assumed)
file C:\Users\Windows\AppData\Local\Temp\ST_2fb0_00000d.tmp saved

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                           712,915  (_merge==3)
    -----------------------------------------
  variable survey_date was float now int
  variable below50k was float now byte
  variable female was float now byte
  variable married was float now byte
  variable lowed was float now byte
  variable highed was float now byte
  variable white was float now byte
  variable black was float now byte
  variable hispanic was float now byte
  variable nonhispwhite was float now byte
  variable nonhispblack was float now byte
  variable mexican was float now byte
  variable noncitizen was float now byte
  variable naturalized was float now byte
  variable immigrant was float now byte
  variable native was float now byte
  variable yearsus was float now byte
  variable citizen was float now byte
  variable citizen_brown was float now byte
  variable citizens_household was float now byte
  variable noncitizens_household was float now byte
  variable totindv_household was float now byte
  variable mixedstatus was float now byte
  variable likely_unauthorized was float now byte
  variable likely_mixedstatus was float now byte
  variable wr was float now int
  variable presidential was float now byte
  (56,320,285 bytes saved)
file C:/Users/Windows/Documents/5. Research/TFG EI/data/temp/cps_volunteer_temp.dta saved

. 
. 
. 
. *------- Cleaning for CPS Voters and Registered ---------------------------*
.         use "${temp}/cps_voters_temp.dta", clear 

.                 
.         * Dummy for voting
.         * The universe for VOTE_CAT (voted in CPS) is eligible voters (+18, citizens)
.         rename voted vote_cat

.         gen voted = 0

.         replace voted = 1 if vote_cat==02
(147,235 real changes made)

.         replace voted = . if inrange(vote_cat,96,99)
(161,679 real changes made, 161,679 to missing)

.         drop vote_cat

.         
.         * Dummy for registering to vote:
.         * The universe for VOREG compromises only those persons who did not vote !!
.         * Not in universe: code 99 (I will later restrict to citizens 18+)
.         * My dummy variable = individuals who registered (vote and no vote)
.         
.         
.         gen registered = 0

.         replace registered = . if inrange(voreg,96,99)
(310,408 real changes made, 310,408 to missing)

.         replace registered = 1 if voreg==02 | voted==1  
(180,447 real changes made)

.         drop voreg

.         
.         * Dummy for voted if registered:
.         gen voted_reg = .
(385,990 missing values generated)

.         replace voted_reg = 0 if registered==1 & voted == 0
(31,573 real changes made)

.         replace voted_reg = 1 if registered==1 & voted ==1
(147,235 real changes made)

.         
.                 
.         
.         save "${temp}/cps_voters.dta", replace
file C:/Users/Windows/Documents/5. Research/TFG EI/data/temp/cps_voters.dta saved

. 
. 
. 
. *------- Cleaning for CPS Civic Engagement --------------------------------*
.         use "${temp}/cps_civic_temp.dta", clear 

.         
.         
.         save "${temp}/cps_civic.dta", replace
file C:/Users/Windows/Documents/5. Research/TFG EI/data/temp/cps_civic.dta saved

.         
. *------- Cleaning for CPS Volunteers --------------------------------------*
.         use "${temp}/cps_volunteer_temp.dta", clear 

.         save "${temp}/cps_volunteer.dta", replace
file C:/Users/Windows/Documents/5. Research/TFG EI/data/temp/cps_volunteer.dta saved

.         
. 
. 
end of do-file

. corr citizen citizen_brown
(obs=712,915)

             |  citizen citiz~wn
-------------+------------------
     citizen |   1.0000
citizen_br~n |   0.9432   1.0000


